{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Bases de Datos No Relacionales\n",
    "\n",
    "## Proyecto Final - López & Ríos"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/javascript": [
       "var link = document.createElement(\"link\");\n",
       "\tlink.ref = \"stylesheet\";\n",
       "\tlink.type = \"text/css\";\n",
       "\tlink.href = \"https://cdnjs.cloudflare.com/ajax/libs/vis/4.8.2/vis.css\";\n",
       "\tdocument.head.appendChild(link);\n",
       "require.config({     paths: {         vis: '//cdnjs.cloudflare.com/ajax/libs/vis/4.8.2/vis.min'     } }); require(['vis'], function(vis) {  window.vis = vis; }); "
      ],
      "text/plain": [
       "<IPython.core.display.Javascript object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "py2neo version 2021.2.3\n"
     ]
    }
   ],
   "source": [
    "\n",
    "#Comenzamos por importar las bibliotecas necesarias \n",
    "\n",
    "import os\n",
    "import pandas as pd\n",
    "import time\n",
    "\n",
    "#permite conectarse a la BD \n",
    "#Fuente: https://py2neo.org/2021.1/\n",
    "import py2neo\n",
    "from py2neo import Graph,Node,Relationship\n",
    "\n",
    "#permite representar gráficamente los grafos obtenidos \n",
    "#Fuente: https://github.com/merqurio/neo4jupyter\n",
    "import neo4jupyter\n",
    "neo4jupyter.init_notebook_mode()\n",
    "\n",
    "\n",
    "print ('py2neo version', py2neo.__version__)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "#estos son los parámetros para la conexión a una instancia de Neo4j que se ejecuta localmente \n",
    "#y en el puerto por defecto\n",
    "#si van a utilizar otra opción deben ajustar los parámetros\n",
    "\n",
    "\n",
    "#indica la url de la BD\n",
    "#dburl='http://localhost:7474'\n",
    "dburl='bolt://127.0.0.1:7687'\n",
    "user='neo4j'\n",
    "pasw='admin12345'\n",
    "\n",
    "graph = Graph(dburl, auth=(user, pasw))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Execution time: 106.7138307094574 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s</th>\n",
       "      <th>m</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'latitude': -18.96666666, 'name': 'GO/A011/SA...</td>\n",
       "      <td>{'station_name': 'GO/A011/SAO SIMAO', 'date': ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>{'latitude': -10.16583333, 'name': 'MT/A911/SA...</td>\n",
       "      <td>{'station_name': 'MT/A911/SAPEZAL', 'date': 20...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>{'latitude': -16.96666666, 'name': 'GO/A023/CA...</td>\n",
       "      <td>{'station_name': 'GO/A023/CAIAPONIA', 'date': ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>{'latitude': -16.45, 'name': 'MT/A907/RONDONOP...</td>\n",
       "      <td>{'station_name': 'MT/A907/RONDONOPOLIS', 'date...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>{'latitude': -20.47555554, 'name': 'MS/A719/AQ...</td>\n",
       "      <td>{'station_name': 'MS/A719/AQUIDAUANA', 'date':...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>107</th>\n",
       "      <td>{'latitude': -15.59638888, 'name': 'DF/A045/AG...</td>\n",
       "      <td>{'station_name': 'DF/A045/AGUAS EMENDADAS', 'd...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>108</th>\n",
       "      <td>{'latitude': -15.062696, 'name': 'MT/A922/VILA...</td>\n",
       "      <td>{'date': 2019-01-01, 'station_name': 'MT/A922/...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>109</th>\n",
       "      <td>{'latitude': -16.42305554, 'name': 'GO/A028/IP...</td>\n",
       "      <td>{'station_name': 'GO/A028/IPORA', 'date': 2019...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>110</th>\n",
       "      <td>{'latitude': -13.41111111, 'name': 'MT/A929/NO...</td>\n",
       "      <td>{'station_name': 'MT/A929/NOVA UBIRATA', 'date...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>111</th>\n",
       "      <td>{'latitude': -19.122471, 'name': 'MS/A742/CASS...</td>\n",
       "      <td>{'station_name': 'MS/A742/CASSILANDIA', 'date'...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>112 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                     s  \\\n",
       "0    {'latitude': -18.96666666, 'name': 'GO/A011/SA...   \n",
       "1    {'latitude': -10.16583333, 'name': 'MT/A911/SA...   \n",
       "2    {'latitude': -16.96666666, 'name': 'GO/A023/CA...   \n",
       "3    {'latitude': -16.45, 'name': 'MT/A907/RONDONOP...   \n",
       "4    {'latitude': -20.47555554, 'name': 'MS/A719/AQ...   \n",
       "..                                                 ...   \n",
       "107  {'latitude': -15.59638888, 'name': 'DF/A045/AG...   \n",
       "108  {'latitude': -15.062696, 'name': 'MT/A922/VILA...   \n",
       "109  {'latitude': -16.42305554, 'name': 'GO/A028/IP...   \n",
       "110  {'latitude': -13.41111111, 'name': 'MT/A929/NO...   \n",
       "111  {'latitude': -19.122471, 'name': 'MS/A742/CASS...   \n",
       "\n",
       "                                                     m  \n",
       "0    {'station_name': 'GO/A011/SAO SIMAO', 'date': ...  \n",
       "1    {'station_name': 'MT/A911/SAPEZAL', 'date': 20...  \n",
       "2    {'station_name': 'GO/A023/CAIAPONIA', 'date': ...  \n",
       "3    {'station_name': 'MT/A907/RONDONOPOLIS', 'date...  \n",
       "4    {'station_name': 'MS/A719/AQUIDAUANA', 'date':...  \n",
       "..                                                 ...  \n",
       "107  {'station_name': 'DF/A045/AGUAS EMENDADAS', 'd...  \n",
       "108  {'date': 2019-01-01, 'station_name': 'MT/A922/...  \n",
       "109  {'station_name': 'GO/A028/IPORA', 'date': 2019...  \n",
       "110  {'station_name': 'MT/A929/NOVA UBIRATA', 'date...  \n",
       "111  {'station_name': 'MS/A742/CASSILANDIA', 'date'...  \n",
       "\n",
       "[112 rows x 2 columns]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#match station_measurement:where\n",
    "query_station_measurement_where=\"\"\"MATCH (s:Station)-->(m:Measurement) WHERE m.hour = time(\"2:00\") AND m.date = date(\"2019-01-01\") RETURN s, m\"\"\"\n",
    "\n",
    "#evaluamos las consultas\n",
    "elapsed_time = 0\n",
    "for i in range(5):\n",
    "    st = time.time()\n",
    "    result_query_station_measurement_where=graph.run(query_station_measurement_where).to_data_frame()\n",
    "    et = time.time()\n",
    "    # get the execution time\n",
    "    elapsed_time += et - st\n",
    "    \n",
    "print('Execution time:', elapsed_time, 'seconds')\n",
    "\n",
    "#imprimo resultados\n",
    "result_query_station_measurement_where"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Execution time: 14.634455966949464 seconds\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>m</th>\n",
       "      <th>s</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'station_name': 'GO/A011/SAO SIMAO', 'date': ...</td>\n",
       "      <td>{'latitude': -18.96666666, 'name': 'GO/A011/SA...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>{'station_name': 'MT/A911/SAPEZAL', 'date': 20...</td>\n",
       "      <td>{'latitude': -10.16583333, 'name': 'MT/A911/SA...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>{'station_name': 'GO/A023/CAIAPONIA', 'date': ...</td>\n",
       "      <td>{'latitude': -16.96666666, 'name': 'GO/A023/CA...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>{'station_name': 'MT/A907/RONDONOPOLIS', 'date...</td>\n",
       "      <td>{'latitude': -16.45, 'name': 'MT/A907/RONDONOP...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>{'station_name': 'MS/A719/AQUIDAUANA', 'date':...</td>\n",
       "      <td>{'latitude': -20.47555554, 'name': 'MS/A719/AQ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>107</th>\n",
       "      <td>{'station_name': 'DF/A045/AGUAS EMENDADAS', 'd...</td>\n",
       "      <td>{'latitude': -15.59638888, 'name': 'DF/A045/AG...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>108</th>\n",
       "      <td>{'date': 2019-01-01, 'station_name': 'MT/A922/...</td>\n",
       "      <td>{'latitude': -15.062696, 'name': 'MT/A922/VILA...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>109</th>\n",
       "      <td>{'station_name': 'GO/A028/IPORA', 'date': 2019...</td>\n",
       "      <td>{'latitude': -16.42305554, 'name': 'GO/A028/IP...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>110</th>\n",
       "      <td>{'station_name': 'MT/A929/NOVA UBIRATA', 'date...</td>\n",
       "      <td>{'latitude': -13.41111111, 'name': 'MT/A929/NO...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>111</th>\n",
       "      <td>{'station_name': 'MS/A742/CASSILANDIA', 'date'...</td>\n",
       "      <td>{'latitude': -19.122471, 'name': 'MS/A742/CASS...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>112 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                     m  \\\n",
       "0    {'station_name': 'GO/A011/SAO SIMAO', 'date': ...   \n",
       "1    {'station_name': 'MT/A911/SAPEZAL', 'date': 20...   \n",
       "2    {'station_name': 'GO/A023/CAIAPONIA', 'date': ...   \n",
       "3    {'station_name': 'MT/A907/RONDONOPOLIS', 'date...   \n",
       "4    {'station_name': 'MS/A719/AQUIDAUANA', 'date':...   \n",
       "..                                                 ...   \n",
       "107  {'station_name': 'DF/A045/AGUAS EMENDADAS', 'd...   \n",
       "108  {'date': 2019-01-01, 'station_name': 'MT/A922/...   \n",
       "109  {'station_name': 'GO/A028/IPORA', 'date': 2019...   \n",
       "110  {'station_name': 'MT/A929/NOVA UBIRATA', 'date...   \n",
       "111  {'station_name': 'MS/A742/CASSILANDIA', 'date'...   \n",
       "\n",
       "                                                     s  \n",
       "0    {'latitude': -18.96666666, 'name': 'GO/A011/SA...  \n",
       "1    {'latitude': -10.16583333, 'name': 'MT/A911/SA...  \n",
       "2    {'latitude': -16.96666666, 'name': 'GO/A023/CA...  \n",
       "3    {'latitude': -16.45, 'name': 'MT/A907/RONDONOP...  \n",
       "4    {'latitude': -20.47555554, 'name': 'MS/A719/AQ...  \n",
       "..                                                 ...  \n",
       "107  {'latitude': -15.59638888, 'name': 'DF/A045/AG...  \n",
       "108  {'latitude': -15.062696, 'name': 'MT/A922/VILA...  \n",
       "109  {'latitude': -16.42305554, 'name': 'GO/A028/IP...  \n",
       "110  {'latitude': -13.41111111, 'name': 'MT/A929/NO...  \n",
       "111  {'latitude': -19.122471, 'name': 'MS/A742/CASS...  \n",
       "\n",
       "[112 rows x 2 columns]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#match station_measurement_edge\n",
    "query_station_measurement_edge=\"\"\"MATCH (s:Station)-[:MEASURED{hour: time(\"2:00\"), date:date(\"2019-01-01\")}]->(m:Measurement) RETURN m,s\"\"\"\n",
    "\n",
    "#evaluamos las consultas\n",
    "elapsed_time = 0\n",
    "for i in range(5):\n",
    "    st = time.time()\n",
    "    result_query_station_measurement_edge=graph.run(query_station_measurement_edge).to_data_frame()\n",
    "    et = time.time()\n",
    "    # get the execution time\n",
    "    elapsed_time += et - st\n",
    "    \n",
    "print('Execution time:', elapsed_time/5, 'seconds')\n",
    "\n",
    "#imprimo resultados\n",
    "result_query_station_measurement_edge"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
